---
kind: property
id: P:Autodesk.Revit.DB.ModelText.ModelTextType
source: html/5c649267-6475-9a7b-4ca5-0986bd8c8800.htm
---
# Autodesk.Revit.DB.ModelText.ModelTextType Property

The type for the model text.

## Syntax (C#)
```csharp
public ModelTextType ModelTextType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - Thrown when Nothing nullptr a null reference ( Nothing in Visual Basic) is assigned to this property.